[
  {
    "name": "SwimWays Baby Spring Float with Adjustable Canopy and UPF Sun Protection, Blue Lobster",
    "amazon_url": "https://www.amazon.com/dp/B0CCW5FW43",
    "price": 19.0,
    "prime_eligible": true,
    "product_description": "BABY SPRING FLOAT: Made for children 9-24 months old and comes with all the same great features of the original Baby Spring Float with the addition of new Hyper-Flate technology WATER INTRODUCTION: Part of Swimways's Swim Step 1: First Splash items that helps babies become comfortable in the water, keeping them supported and balanced NEW HYPER-FLATE VALVE: Features extremely innovative and convenient technology that enables parents to inflate the float approximately 3 times faster than before HIGH-QUALITY BUILD: Made with comfortable anti-stick fabric featuring underwater animals and inner spring technology for stability PROTECTIVE CANOPY: Provides 60-degree protection and is adjustable and removable to provide shade from the sun Inlcudes: 1 Swimways Sun Canopy Baby Spring Float, Mermaid Covered by the Spin Master Care Commitment. See below for full details",
    "image_url": "https://m.media-amazon.com/images/I/81JWQ0HknoL._AC_SL1500_.jpg",
    "min_age": 9,
    "max_age": 24,
    "gender": "unisex",
    "category": "toys",
    "description": "This float is perfect for little ones experiencing water for the first time, especially adventurous parents eager to introduce their babies to swimming. Ideal for families who love spending time at the pool or beach, this float provides safety and comfort under the sun.",
    "tags": [
      "baby",
      "water introduction",
      "pool fun",
      "outdoor activities"
    ]
  },
  {
    "name": "Play Doh Bulk Handout 42-Pack of 1-Ounce Modeling Compound Cans, Christmas Stocking Stuffer Gifts, Prizes, & Party Favors, Kids Arts & Crafts, Preschool Toys, Ages 2+ (Amazon Exclusive)",
    "amazon_url": "https://www.amazon.com/dp/B087N9N6HH",
    "price": 16.0,
    "prime_eligible": true,
    "product_description": "42 mini Play-Doh cans in assorted colors for sharing creativity Non-toxic, wheat-free modeling compound for ages 2 and up Great as party favors, classroom prizes, or stocking stuffers Easy open flip-top box for quick distribution",
    "image_url": "https://m.media-amazon.com/images/I/81QQOmhZwOL._AC_SL1500_.jpg",
    "min_age": 2,
    "max_age": 10,
    "gender": "unisex",
    "category": "toys",
    "description": "This delightful set of Play-Doh is perfect for young creators who love to express their imagination through arts and crafts. Ideal for kids who enjoy hands-on activities, this gift will spark creativity and provide endless fun during playtime. Great for birthday parties, classrooms, or as a festive stocking stuffer!",
    "tags": [
      "creative",
      "young artist",
      "arts and crafts",
      "party favors"
    ]
  },
  {
    "name": "Melissa & Doug Blockables™ Town Snap and Play, Mix and Match Connectable Wooden Building Blocks Play Set Toy for Preschool Boys and Girls (73 Pcs)",
    "amazon_url": "https://www.amazon.com/dp/B0D7NKNJDG",
    "price": 19.0,
    "prime_eligible": true,
    "product_description": "Melissa & Doug Blockables are connectable, stackable, and playable solid wood building blocks, perfect for little hands and big imaginations; special connectors let kids 2 and older easily snap together smooth, colorful blocks to create a fun neighborhood playground and vehicle to play with, or combine to build their own silly and cool creations Town Play Set includes 30 wooden blocks, 4 play figures, 32 connectors, 2 felt trees and a felt swing/slide/strap with built-in connectors, 4 wheels, and an illustrated play guide for putting together a swing, rocker, carousel, vehicle, pets, and more Build a collection - compatible with all other Blockables play sets; packaging folds out to double as a play space and pieces store in the sturdy box with handle for easy cleanup and portability; patent pending Like all Melissa & Doug toys, Blockables are designed to promote and support important developmental benefits for kids: They encourage fine motor, problem-solving, and matching skills, introduce storytelling, and help build self-esteem as kids build and create their own toys again and again Makes a great gift for preschool and older girls and boys, ages 2 to 7, for hands-on, screen-free play; This product is certified by the Forest Stewardship Council. Please note that FSC certification applies to new inventory only (FSC C156584)",
    "image_url": "https://m.media-amazon.com/images/I/71tQcdTrzGL._AC_SL1500_.jpg",
    "min_age": 2,
    "max_age": 7,
    "gender": "unisex",
    "category": "toys",
    "description": "This gift is perfect for imaginative toddlers and preschoolers who love to build and create. Ideal for kids who enjoy hands-on play, storytelling, and developing fine motor skills. Great for those who thrive in creative environments and prefer interactive toys over screens.",
    "tags": [
      "creative",
      "imaginative",
      "hands-on",
      "preschool",
      "building blocks"
    ]
  },
  {
    "name": "MAGNA-TILES Rail Racers Deluxe 90-Piece Magnetic Construction Set, The Original Magnetic Building Brand",
    "amazon_url": "https://www.amazon.com/dp/B0DW99M4NM",
    "price": 49.0,
    "prime_eligible": true,
    "product_description": "What’s Included: 90 magnetic pieces, including 6 patent-pending track rails! What Makes It Unique: Created by a MAGNA-TILES fan and Super Dad, Rail Racers are designed to let kids build like never before! Build racetracks, ramps, bridges and more to enhance the open-ended play experience! Developmental: Encourages children to learn through play, exploring cause and effect and other logic principles, while fostering the development of hand-eye coordination and fine motor skills. Great for Gifting: Makes a great gift for adventure-loving kids ages 3+. More to Explore: Add MAGNA-TILES Classic Tiles or microMAGS to create a world of fast-paced adventure!",
    "image_url": "https://m.media-amazon.com/images/I/819XZUqlqNL._AC_SL1500_.jpg",
    "min_age": 3,
    "max_age": 12,
    "gender": "unisex",
    "category": "toys",
    "description": "This gift is perfect for adventurous and creative children who love building and constructing things. Ideal for kids who enjoy imaginative play, this magnetic construction set will keep them entertained while developing their motor skills and problem-solving abilities. Great for little engineers and builders who thrive on hands-on play and exploration.",
    "tags": [
      "creative",
      "builder",
      "adventurous",
      "imaginative play",
      "hands-on"
    ]
  },
  {
    "name": "LEGO Star Wars: The Phantom Menace Battle Droid with STAP - Building & Learning Toy for Boys & Girls, Ages 12+ - Star Wars Toy & Model Kit - Gift for Christmas - 75428",
    "amazon_url": "https://www.amazon.com/dp/B0DRW6VY43",
    "price": 89.0,
    "prime_eligible": true,
    "product_description": "PLAY & DISPLAY BATTLE DROID– Star Wars fans can construct a detailed LEGO Star Wars Battle Droid with STAP (75428) from Episode 1: The Phantom Menace POSABLE LEGO STAR WARS FIGURE – The buildable Battle Droid features multiple articulation points and comes with a brick-built blaster that can be attached to its back or held in its hands STAR WARS MODEL KIT– The completed droid can be displayed on its stand with information plaque or removed for dynamic pretend battle scenarios STAR WARS DECOR – The Battle Droid on its STAP speeder makes a striking piece of room decor and includes a bonus Battle Droid minifigure with mini STAP for display or play PERFECT GIFT FOR FANS – Makes an impressive birthday present or holiday gift for 12 year old boys and girls who love Star Wars toys and building models NEXT-LEVEL BUILDING EXPERIENCE – The LEGO Builder app provides intuitive 3D building instructions with zoom and rotate features for an immersive construction experience DIMENSIONS – The Battle Droid on STAP in this 1,088-piece set measures over 15 in. (38 cm) high, 11.5 in. (30 cm) long and 5.5 in. (14 cm) wide when displayed on the stand",
    "image_url": "https://m.media-amazon.com/images/I/81i1gByc2FL._AC_SL1500_.jpg",
    "min_age": 12,
    "max_age": 99,
    "gender": "unisex",
    "category": "toys",
    "description": "This gift is perfect for young builders and Star Wars enthusiasts who enjoy constructing detailed models and engaging in imaginative play. Ideal for kids and adults alike who have a passion for the Star Wars universe and appreciate intricate design and creativity.",
    "tags": [
      "Star Wars fan",
      "builder",
      "model kit",
      "imaginative play",
      "LEGO enthusiast"
    ]
  },
  {
    "name": "Play-Doh Bulk Pack of 48 Cans, 6 Sets of 8 Modeling Compound Colors, 3oz, Holiday Stocking Stuffers, Preschool Toys for Kids, Ages 2+ (Amazon Exclusive)",
    "amazon_url": "https://www.amazon.com/dp/B01FAPXB0K",
    "price": 33.0,
    "prime_eligible": true,
    "product_description": "SHAPE THEIR SCHOOL YEAR: Teachers can inspire their students’ imaginations with this bulk Play-Doh set for back to school supplies, classroom activities for kids, school prizes, and more 6 SETS OF 8 COLORS: Plenty of duplicate colors for kids to share, this Play-Doh pack of 48 cans comes with 6 cans each of green, yellow, orange, red, brown, white, purple, and blue 3 OZ PLAY-DOH CANS: If you do the math, 48 cans times 3 ounces each equals a whopping 9 pounds of irresistibly squishy Play-Doh compound TRUSTED QUALITY: Rigorously tested for quality, Play-Doh compound is made primarily with flour, salt, and water, making it a great choice for arts and crafts for kids who love modeling clay (contains wheat) CREATIVITY IN THE CLASSROOM: Imagination toys like this Play-Doh kit can be great manipulatives for preschool, craft supplies for kids, and so much more",
    "image_url": "https://m.media-amazon.com/images/I/81HQc6QOV-L._AC_SL1500_.jpg",
    "min_age": 2,
    "max_age": 7,
    "gender": "unisex",
    "category": "toys",
    "description": "This bulk Play-Doh pack is perfect for young children who love to explore their creativity through hands-on play. Ideal for preschoolers and early elementary students, it encourages imaginative play and is perfect for both individual and group activities in classrooms or at home. Great for kids who enjoy arts and crafts and developing fine motor skills.",
    "tags": [
      "creative",
      "preschool",
      "arts and crafts"
    ]
  },
  {
    "name": "Melissa & Doug Blockables™ Vehicles Snap and Play, Mix and Match Connectable Wooden Building Blocks Play Set Toy for Preschool Boys and Girls (54 Pcs)",
    "amazon_url": "https://www.amazon.com/dp/B0D7N73XTQ",
    "price": 17.0,
    "prime_eligible": true,
    "product_description": "Melissa & Doug Blockables are connectable, stackable, and playable solid wood building blocks, perfect for little hands and big imaginations; special connectors let kids 2 and older easily snap together smooth, colorful blocks to create fun vehicles to play with, or combine to build their own silly and cool creations Vehicles Play Set includes 18 wooden blocks, 2 play figures, 17 connectors, felt wings, propeller, and sail with built-in connectors, tractor hitch, windshield, and illustrated instructions for putting together fun “things that go” (sailboat, airplane, tractor with trailer, race car) Build a collection - compatible with all other Blockables play sets; packaging folds out to double as a play space and pieces store in the sturdy box with handle for easy cleanup and portability; patent pending Like all Melissa & Doug toys, Blockables are designed to promote and support important developmental benefits for kids: They encourage fine motor, problem-solving, and matching skills, introduce storytelling, and help build self-esteem as kids build and create their own toys again and again Makes a great gift for preschool and older girls and boys, ages 2 to 7, for hands-on, screen-free play; This product is certified by the Forest Stewardship Council. Please note that FSC certification applies to new inventory only (FSC C156584)",
    "image_url": "https://m.media-amazon.com/images/I/71tVfQHP5LL._AC_SL1500_.jpg",
    "min_age": 2,
    "max_age": 7,
    "gender": "unisex",
    "category": "toys",
    "description": "This building blocks play set is perfect for imaginative preschoolers who love to create and construct their own vehicles. Ideal for kids who enjoy hands-on activities that promote creativity, fine motor skills, and problem-solving. Great for children who thrive in playful, screen-free environments and enjoy building and storytelling.",
    "tags": [
      "imaginative play",
      "creative builder",
      "preschool",
      "hands-on",
      "motor skills"
    ]
  },
  {
    "name": "MAGNA-TILES Fire Station 50-Piece Magnetic Construction Set, The Original Magnetic Building Brand",
    "amazon_url": "https://www.amazon.com/dp/B0DW98PK9C",
    "price": 41.0,
    "prime_eligible": true,
    "product_description": "What’s Included: 50 magnetic pieces, including one Mix and Match Fire Fighter figure, Light & Sound Tile and extendable Fire Truck Ladder. What Makes It Unique: The MAGNA-TILES Fire Station 50-Piece Set stands out with its Light & Sound Tile, extendable Fire Truck Ladder, and mix-and-match Firefighter figure, creating action-packed rescue missions that spark creativity and heroism. Developmental: Encourages children to learn through play, exploring cause and effect and other logic principles, while fostering the development of hand-eye coordination and fine motor skills. Great for Gifting: Makes a great gift for adventure-loving kids ages 3+. More to Explore: Add MAGNA-TILES Classic sets to the fun and build out an entire fire rescue operation!",
    "image_url": "https://m.media-amazon.com/images/I/71a9BZVhVFL._AC_SL1406_.jpg",
    "min_age": 3,
    "max_age": 10,
    "gender": "unisex",
    "category": "toys",
    "description": "This gift is perfect for imaginative kids who love to engage in creative play and embark on heroic adventures. Children who enjoy building and exploring will thrive with the MAGNA-TILES Fire Station set, as it encourages hands-on learning and development of critical thinking skills through engaging activities. Ideal for those who dream of being firefighters or simply love the thrill of rescue missions.",
    "tags": [
      "imaginative play",
      "creative builder",
      "adventure lover"
    ]
  },
  {
    "name": "EXIT: The Game - Adventures on Catan | Interactive Escape Room Experience| Cooperative | 1-4 Players | 10+ | Kosmos | Game for Kids and Adults",
    "amazon_url": "https://www.amazon.com/dp/B0DSCN12B7",
    "price": 11.0,
    "prime_eligible": true,
    "product_description": "ADVENTURE AWAITS - You leave your dreary life in your village behind to explore the mysterious land of Catan. Can you build a new life for yourself in a foreign land? PUZZLE IT OUT- Solve escape room-style puzzles and use several mysterious objects found in the box to complete the story TRADE AND DISCOVER- Discover Catan pieces to build out the island and collect resources. Then keep your eyes peeled for other residents of Catan who would love to trade with you! ALL TOGETHER- A cooperative experience for 1-4 players that takes 1-2 hours to solve. Great for friend groups and families",
    "image_url": "https://m.media-amazon.com/images/I/81zmdR0+UML._AC_SL1500_.jpg",
    "min_age": 10,
    "max_age": 99,
    "gender": "unisex",
    "category": "games",
    "description": "This game is perfect for families and friend groups who enjoy cooperative challenges and problem-solving. Ideal for those who love adventure and creativity, it appeals to both kids and adults who like to engage in interactive experiences. If you thrive on teamwork and enjoy puzzles, this game will be a fantastic addition to your game night.",
    "tags": [
      "family fun",
      "puzzle lover",
      "cooperative games"
    ]
  },
  {
    "name": "LEGO Jurassic World T. rex River Escape - Dinosaur Toy for Kids, Boys, and Girls, Ages 5-7 - Jurassic World Toy Boat Minifigures - Creative Dinosaur Gift for Movie Fans - 76975",
    "amazon_url": "https://www.amazon.com/dp/B0DRW64FRC",
    "price": 39.0,
    "prime_eligible": true,
    "product_description": "ESCAPE THE MENACING T. REX – Treat fans ages 5 and up to this detailed T. rex River Escape set, designed to immerse young kids in the Jurassic World universe with an action-packed building set POSEABLE DINOSAUR TOY– Features a LEGO Jurassic World T. rex figure with movable legs, arms, tail, head and jaw, plus Teresa Delgado and Xavier Dobbs minifigures to spark fun adventures RELIVE THE MOVIE – This detailed Jurassic World Rebirth dinosaur toy includes a shed with a dock and boat launcher, a small boat toy for kids, an ATV toy, and much more BUILD & REBUILD EPIC ESCAPES– This set has a boat-launcher function to launch the boat toy, and the shed can be destroyed by the T. rex dinosaur figure and then rebuilt so the fun can continue LEGO DINOSAUR GIFT FOR KIDS– Fulfill any kid’s love for dinosaur playsets and adventure toys with a set that makes a great birthday present or holiday gift for boys or girls. INSPIRE CREATIVITY – Encourage kids' love of dinosaurs and nature and expand their story-telling skills with a fun-to-build LEGO Jurassic World dinosaur toy adventure playset A NEW WAY TO BUILD – The LEGO Builder app guides kids on an intuitive building adventure, letting them save sets, track their progress, zoom in and rotate models in 3D while they build DIMENSIONS– The shed together with the attached dock and boat, in this 199-piece set measure over 3.5 in. (8 cm) high, 8 in. (20 cm) wide and 5.5 in. (14 cm) deep",
    "image_url": "https://m.media-amazon.com/images/I/81BSOsZE4DL._AC_SL1500_.jpg",
    "min_age": 5,
    "max_age": 7,
    "gender": "unisex",
    "category": "toys",
    "description": "This LEGO Jurassic World T. rex River Escape set is perfect for young adventure seekers and dinosaur enthusiasts who love to immerse themselves in imaginative play. Kids who enjoy building and storytelling will thrive with this engaging and creative toy that allows them to recreate their favorite movie scenes. It's also a fantastic gift for those who appreciate hands-on activities and have a passion for dinosaurs and nature.",
    "tags": [
      "dinosaur lover",
      "LEGO enthusiast",
      "creative builder"
    ]
  },
  {
    "name": "Fisher-Price Imaginext DC Super Friends, Batman Flight Mech with Lights, Sounds Motion & 3-inch Action Figure, 14.5-inch Toy Includes Launcher & Discs",
    "amazon_url": "https://www.amazon.com/dp/B0DNG34GKF",
    "price": 48.0,
    "prime_eligible": true,
    "product_description": "Bring the action of DC Metal Force to life and power up imagination with the Imaginext Batman Flight Mech suit and action figure playset by Fisher-Price! The giant toy measures 14.5 inches tall and has kid-controlled lights, sounds, movement and launch action, plus a cockpit for the included 3-inch Batman figure! Young Super Heroes can lift the back handle to deploy the bat wings -with a 24-inch wingspan! -and press the back paddles to swing the arms up and down! A push of the button on the mech's back activates multicolored lights and sounds, and one on the arm launches discs -2 are included for lots of storytelling fun! Details, like the Batarang on the launcher, add more inspiration for recreating onscreen action or making up new epic battles! Kids ages 3 years old and up will love immersing themselves in pretend play and letting their imaginations storm into crime-fighting adventure!",
    "image_url": "https://m.media-amazon.com/images/I/81StPZ4J0iL._AC_SL1500_.jpg",
    "min_age": 3,
    "max_age": 8,
    "gender": "unisex",
    "category": "toys",
    "description": "This toy is perfect for young superheroes who love imaginative play and action-packed adventures. Ideal for children who enjoy comic book characters, especially Batman, and delight in interactive toys that spark their creativity. It's great for kids who love to recreate heroic battles and engage in storytelling.",
    "tags": [
      "young hero",
      "imaginative play",
      "action figures",
      "Batman fan"
    ]
  },
  {
    "name": "Play-Doh Modeling Compound 24-Pack Case of Colors, Non-Toxic, 3 Oz Cans of Assort. Colors, Back to School Classroom Supplies, Preschool Toys, Ages 2+ (Amazon Exclusive)",
    "amazon_url": "https://www.amazon.com/dp/B009CAPYR8",
    "price": 21.0,
    "prime_eligible": true,
    "product_description": "PLAY-DOH VARIETY 24-PACK: Kids can make their own world of colorful creations with this Play-Doh 24-pack of 3-ounce cans CREATIVITY FOR EVERY OCCASION: Shape, squish, mix, and make all kinds of arts and craft activities for kids. Great for classroom prizes, stocking stuffers for kids, trick or treat toys, bulk party favors for kids, and more 3 OUNCES PER CAN: These 3 oz Play-Doh cans make great imaginative play toys for 2 year old boys and girls who love arts and crafts like modeling clay INSPIRE IMAGINATIVE PRETEND PLAY: This bulk Play-Doh variety pack inspires imaginative pretend play for toddlers and kids who love arts and crafts and creative toys ORIGINAL PLAY-DOH QUALITY: A favorite since 1956, Play-Doh modeling compound is made primarily with wheat, water, and salt, and goes through vigorous testing so it’s always high quality and super fun",
    "image_url": "https://m.media-amazon.com/images/I/81Ki3Z1FL-L._AC_SL1500_.jpg",
    "min_age": 2,
    "max_age": 8,
    "gender": "unisex",
    "category": "toys",
    "description": "Perfect for young children who love to explore their creativity through hands-on play. This gift is ideal for little artists who enjoy shaping and molding materials, making it a great choice for kids who thrive in imaginative environments. It's also a fantastic option for parents looking for educational and entertaining activities for their preschoolers.",
    "tags": [
      "creative",
      "young artist",
      "imaginative play"
    ]
  },
  {
    "name": "Melissa & Doug Blockables™ Farm Snap and Play, Mix and Match Connectable Wooden Building Blocks Play Set Toy for Preschool Boys and Girls (56 Pcs)",
    "amazon_url": "https://www.amazon.com/dp/B0D7N6YJ7M",
    "price": 16.0,
    "prime_eligible": true,
    "product_description": "Melissa & Doug Blockables are connectable, stackable, and playable solid wood building blocks, perfect for little hands and big imaginations; special connectors let kids 2 and older easily snap together smooth, colorful blocks to create fun farm animals and equipment to play with, or combine to build their own silly and cool creations Farm Play Set includes 21 wooden blocks, 2 play figures, 22 connectors, felt horns and chicken wings with built-in connectors, trailer hitch, windshield, 6 wheels, large tractor wheels, and illustrated play guide for putting together a tractor and trailer, cow, sheep, pig, horse, chicken, food, and hay bale Build a collection - compatible with all other Blockables play sets; packaging folds out to double as a play space and pieces store in the sturdy box with handle for easy cleanup and portability; patent pending Like all Melissa & Doug toys, Blockables are designed to promote and support important developmental benefits for kids: They encourage fine motor, problem-solving, and matching skills, introduce storytelling, and help build self-esteem as kids build and create their own toys again and again Makes a great gift for preschool and older girls and boys, ages 2 to 7, for hands-on, screen-free play; This product is certified by the Forest Stewardship Council. Please note that FSC certification applies to new inventory only (FSC C156584)",
    "image_url": "https://m.media-amazon.com/images/I/71e+p6H4pdL._AC_SL1500_.jpg",
    "min_age": 2,
    "max_age": 7,
    "gender": "unisex",
    "category": "toys",
    "description": "Perfect for young children who love to build and create with their hands, this play set inspires imaginative play and storytelling. Ideal for preschoolers who enjoy hands-on activities and developing their fine motor skills through creative block play.",
    "tags": [
      "preschool",
      "creative",
      "hands-on",
      "imaginative",
      "building blocks"
    ]
  },
  {
    "name": "The Thames & Kosmos Metal Detector Essential STEM Tool for Kids | Detects Metal 6” Deep, Lightweight & Ergonomic Design w/Adjustable Arm Length | LCD Screen w/Audio Feedback, Accurate Explorations",
    "amazon_url": "https://www.amazon.com/dp/B0DS6JN4HX",
    "price": 37.0,
    "prime_eligible": true,
    "product_description": "HUNT FOR TREASURE! Kids ages 8 & up can search for metal objects like gold, silver, iron, copper, and more with this custom-tooled metal detector! Detects metal buried up to 6 inches deep in sand, dirt, or grass. EASE OF USE: Ergonomically designed for users of all sizes, this metal detector comes with two handles of differing heights. DIGITAL LCD DISPLAY GUIDES EXPLORATION: The integrated digital display with simple, one-button control provides accurate visual feedback as you home in on a metal object and emits a clear \"beep\" when you've found your mark! ADJUSTABLE NECK ANGLE: Explore between rocks, under bushes, and other hard-to-reach places by modifying the angle of the search coil. ENCOURAGES OUTDOOR PLAY: Perfect tool for open-ended science and nature discoveries for the youngest explorers!",
    "image_url": "https://m.media-amazon.com/images/I/71TZCZzPjAL._AC_SL1500_.jpg",
    "min_age": 8,
    "max_age": 14,
    "gender": "unisex",
    "category": "toys",
    "description": "This metal detector is perfect for adventurous kids who have a knack for exploration and love the thrill of discovering hidden treasures. Ideal for young scientists and nature enthusiasts, it encourages outdoor play and curiosity about the world around them. Whether they're searching for coins in the backyard or exploring a local park, this tool will spark their imagination and sense of adventure.",
    "tags": [
      "young explorer",
      "nature lover",
      "STEM enthusiast"
    ]
  },
  {
    "name": "LEGO Friends Friendship Camper Van Adventure Toy Building Set - Pretend Play Set for Kids, Girls and Boys, Ages 7+ - Gift Idea for Birthday - with 3 Minidolls and Ferret Figure - 42663",
    "amazon_url": "https://www.amazon.com/dp/B0DJ19GJVW",
    "price": 22.0,
    "prime_eligible": true,
    "product_description": "CAMPING ADVENTURE TOY – This LEGO Friends camping themed playset for girls and boys comes with 3 minidolls and a ferret figure for kids to create friendship stories BUILD A CAMPER VAN – Kids can play out different scenarios as they open the model camper van’s interior to find spaces for cooking, sleeping and relaxing INTERACTIVE PLAY – This camp site toy set includes 3 minidoll characters and a ferret figure to inspire hours of imaginative storytelling, as kids tell camp stories, sleep overs in the RV and more FUN ACCESSORIES – The toy van comes with a bike, picnic table, ‘flushing’ toilet, outdoor shower and lots of camping toy accessories for kids, including binoculars, a compass and a wrench HOLIDAY OR BIRTHDAY GIFT IDEA – This camping and RV building set is a fun gift idea for young explorers who enjoy nature and animals, or little ones that love to create their own camping adventures DIMENSIONS – The camper van measures over 9 in. (23 cm) long",
    "image_url": "https://m.media-amazon.com/images/I/81VWRT1HFdL._AC_SL1500_.jpg",
    "min_age": 7,
    "max_age": 12,
    "gender": "unisex",
    "category": "toys",
    "description": "This LEGO Friends Friendship Camper Van Adventure Toy is perfect for imaginative kids who enjoy pretend play and storytelling. It's ideal for young explorers who love camping, nature, and creating adventures with friends. If your child enjoys building, role-playing, and outdoor activities, this set will spark their creativity and provide hours of fun.",
    "tags": [
      "imaginative play",
      "camping lover",
      "LEGO enthusiast"
    ]
  },
  {
    "name": "LEGO Creator 3 in 1 Medieval Dragon Toy - Building Toy with 3 Build Options, Dragon, Sea Serpent, or Phoenix - Fantasy Set for Kids, Boys and Girls, Ages 9+ - Gift Idea for Birthdays - 31161",
    "amazon_url": "https://www.amazon.com/dp/B0DJ1B4PZR",
    "price": 56.0,
    "prime_eligible": true,
    "product_description": "3 BUILDABLE MEDIEVAL CREATURE TOYS – The LEGO Creator 3 in 1 Medieval Dragon figure lets boys and girls ages 9 years old and older build and rebuild 3 different fantasy animal toys using the same bricks ENDLESS PLAY OPTIONS – Kids can role-play medieval stories with 3 different mythical creature toys (models cannot be built simultaneously): a toy dragon, a sea serpent or a phoenix POSABLE – All 3 highly detailed medieval toy building options have posable body parts so kids can enjoy imaginative play as they place them into different positions PLAY AND DISPLAY – Animal figures can be displayed on a shelf or bedside table after playtime, while the phoenix toy comes with a brick-built stand GIFT FOR BOYS AND GIRLS – This 3 in 1 toy provides an immersive build-and-play experience for fans of mythical animals and can be given as a fun birthday gift A FUN WAY TO BUILD – Let the LEGO Builder app guide kids on an intuitive creative adventure as they save sets, track progress and zoom in and rotate models in 3D as they build DIMENSIONS – This 715-piece LEGO animal set features a dragon figurine measuring over 5 in. (13 cm) high, 15.5 in. (39 cm) long and 20.5 in. (52 cm) wide",
    "image_url": "https://m.media-amazon.com/images/I/81ya5MWpykL._AC_SL1500_.jpg",
    "min_age": 9,
    "max_age": 99,
    "gender": "unisex",
    "category": "toys",
    "description": "This LEGO Creator 3 in 1 Medieval Dragon Toy is perfect for imaginative kids who love fantasy stories and building things. Ideal for those who enjoy creative play, whether they are role-playing epic adventures or displaying their creations. It's a great gift for children who appreciate detailed models and enjoy hands-on activities.",
    "tags": [
      "imaginative",
      "builder",
      "fantasy lover",
      "LEGO fan",
      "creative"
    ]
  },
  {
    "name": "Apple Watch SE (2nd Gen) [GPS 40mm] Smartwatch with Starlight Aluminum Case with Starlight Sport Band S/M. Fitness and Sleep Trackers, Crash Detection, Heart Rate Monitor, Retina Display",
    "amazon_url": "https://www.amazon.com/dp/B0DGJ73CFS",
    "price": 0.0,
    "prime_eligible": false,
    "product_description": "WHY APPLE WATCH SE — All the essentials to help you be motivated and active, keep connected, track your health, and stay safe. watchOS 11 brings more intelligence, personalization, and connectivity. With features like Fall Detection and enhanced workout metrics, Apple Watch SE is an incredible value. STAY CONNECTED — Send a text, take a call, listen to music and podcasts, use Siri, or call for help with Emergency SOS.* Apple Watch SE (GPS) works with your iPhone or Wi-Fi to keep you connected. HEALTH AND SAFETY FEATURES — Get insights into your health, including notifications if you have an irregular heart rhythm* or an unusually high or low heart rate. Get help when you need it with Fall Detection, Crash Detection, and Emergency SOS.* Automatically notify loved ones when you arrive at your destination with Check In.* SIMPLY COMPATIBLE — It works seamlessly with your Apple devices and services.* Unlock your Mac automatically. Find your devices easily. Pay and send money with Apple Pay. SWIMPROOF AND FASHIONABLE — 50m water resistance.* Three finishes. And a color-matched back case made with a production process that reduces its carbon emissions. EASILY CUSTOMIZABLE — With watch bands in a range of styles, materials, and colors and fully customizable watch faces, you can change your watch to fit your mood or the moment. A GREAT FITNESS PARTNER — The Workout app gives you a range of ways to train plus advanced metrics for more insights into your workout performance. And Apple Watch comes with three months of Apple Fitness+ free.* APPLE WATCH FOR YOUR KIDS — Set up Apple Watch for those who don’t yet have their own iPhone, so everyone can stay connected, active, healthy, and safe.* CARBON NEUTRAL — Apple Watch SE (2nd generation) is carbon neutral when paired with select bands. Learn more about Apple’s commitment to the environment at apple.com/2030. * LEGAL DISCLAIMERS — This is a summary of the main product features. See below to learn more.",
    "image_url": "https://m.media-amazon.com/images/I/61umEhyV-UL._AC_SL1500_.jpg",
    "min_age": 10,
    "max_age": 99,
    "gender": "unisex",
    "category": "electronics",
    "description": "This Apple Watch SE is perfect for anyone who values health, fitness, and staying connected. Ideal for active individuals or those just getting into fitness tracking, this smartwatch combines style with functionality. Whether you're a tech-savvy teen or a fitness-focused adult, this watch adapts to your lifestyle and keeps you motivated.",
    "tags": [
      "fitness enthusiast",
      "tech savvy",
      "active lifestyle",
      "health conscious",
      "fashionable"
    ]
  },
  {
    "name": "Apple iPad mini (A17 Pro): Apple Intelligence, 8.3-inch Liquid Retina Display, 128GB, Wi-Fi 6E, 12MP Front/12MP Back Camera, Touch ID, All-Day Battery Life — Blue",
    "amazon_url": "https://www.amazon.com/dp/B0DK3YF38G",
    "price": 0.0,
    "prime_eligible": false,
    "product_description": "WHY IPAD MINI — The full iPad experience in an ultraportable design. Featuring Apple Intelligence.* With an 8.3-inch Liquid Retina display,* ultrafast A17 Pro chip, 12MP Ultra Wide front camera with Center Stage, USB-C connectivity, superfast Wi-Fi 6E, and compatibility with Apple Pencil Pro.* Take notes, mark up documents, and edit photos and videos. BUILT FOR APPLE INTELLIGENCE—Apple Intelligence is the personal intelligence system that helps you write, express yourself, and get things done effortlessly. With groundbreaking privacy protections, it gives you peace of mind that no one else can access your data—not even Apple.* 8.3-INCH LIQUID RETINA DISPLAY — The gorgeous Liquid Retina display features advanced technologies like P3 wide color, True Tone, and ultralow reflectivity, which make everything look stunning.* PERFORMANCE AND STORAGE — The A17 Pro chip delivers powerful performance and ultrafast graphics. And with all-day battery life, iPad mini is always ready for any task or project.* Storage starting at 128GB for all your apps, music, movies, and more.* IPADOS + APPS — iPadOS makes iPad more productive, intuitive, and versatile. With iPadOS, run multiple apps at once, use Apple Pencil to write in any text field with Scribble, and edit and share photos. iPad mini comes with essential apps like Safari, Messages, and Keynote, with over a million more apps available on the App Store. APPLE PENCIL AND SMART FOLIO — Apple Pencil Pro transforms iPad mini into an immersive drawing canvas and the world’s best note‑taking device. Apple Pencil (USB-C) is also compatible with iPad mini. To protect your iPad mini and easily prop it up, you can use the slim Smart Folio covers, available in four colors.* ADVANCED CAMERAS — iPad mini features a 12MP Ultra Wide front camera that supports Center Stage for videoconferencing and selfies. The 12MP Wide back camera with True Tone flash is perfect for document scanning and capturing photos and 4K videos. CONNECTIVITY — Wi-Fi 6E...",
    "image_url": "https://m.media-amazon.com/images/I/71yhrd0k2UL._AC_SL1500_.jpg",
    "min_age": 12,
    "max_age": 99,
    "gender": "unisex",
    "category": "electronics",
    "description": "Perfect for creative individuals, students, and professionals who appreciate cutting-edge technology and portability. This iPad mini is ideal for those who love to take notes, draw, or edit photos on the go, making it a versatile tool for both work and play. Whether they're a tech enthusiast or an artistic soul, this device will enhance their productivity and creativity.",
    "tags": [
      "tech lover",
      "student",
      "creative",
      "digital artist",
      "mobile professional"
    ]
  },
  {
    "name": "Beats Pill - Portable Bluetooth Speaker - Up to 24H Battery Life, Water Resistant, Bluetooth, Apple & Android Compatible, Seriously Loud Sound for Home, Outdoor and Travel - Matte Black",
    "amazon_url": "https://www.amazon.com/dp/B0D4SX9RC6",
    "price": 99.0,
    "prime_eligible": true,
    "product_description": "The Beats Pill delivers powerful, room-filling sound. The bigger, bespoke racetrack woofer displaces 90% more air volume, packing more of a punch with deeper, fuller bass. The Beats Pill has up to 24 hours of battery life for all-day playback and can be used to charge your phone or other devices via USB-C cable. The portable speaker is IP67-rated for dust and water resistance for outstanding durability and includes a removable lanyard and soft-grip silicone backing to make it easy to take with you. The redesigned tweeter provides extra stability for crisp highs and rich mid-range tones while the woofer’s material and structure helps minimize low-end distortion even at high volumes Enjoy high-resolution lossless audio from your Beats Pill by connecting it to your laptop or other compatible devices via the USB-C cable Easily pair two Beats Pill speakers for twice the output experience in Amplify mode or Stereo mode. Apple and Android compatibility – including instant one-touch pairing and automatic pairing across your other devices, plus Find My or Find My Device. Take calls and activate your voice assistant directly from a paired Beats Pill.",
    "image_url": "https://m.media-amazon.com/images/I/71IsrpuSomL._AC_SL1500_.jpg",
    "min_age": 15,
    "max_age": 99,
    "gender": "unisex",
    "category": "electronics",
    "description": "This gift is perfect for music lovers who enjoy taking their tunes on the go. Ideal for outdoor enthusiasts, travelers, or anyone who loves to host gatherings with great sound quality. With its durable design and impressive battery life, this speaker suits active individuals who appreciate technology that enhances their lifestyle.",
    "tags": [
      "music lover",
      "outdoorsy",
      "gadget enthusiast",
      "traveler"
    ]
  },
  {
    "name": "MAGNA-TILES microMAGS 26-Piece Travel Magnetic Construction Set – Bold Colors, The Original Magnetic Building Brand",
    "amazon_url": "https://www.amazon.com/dp/B0CX4RLCXW",
    "price": 13.0,
    "prime_eligible": true,
    "product_description": "What’s Included: 26 microMAGS magnetic tiles, including: 4 Right Triangles, 4 Isosceles Triangles, 6 Equilateral Triangles, 12 Squares. The metal tin packaging provides both convenient storage and baseplate for builds on the go. What Makes It Unique: This set is a must-have travel companion for family trips – whether by plane, train or automobile – and restaurants, too! Developmental: Encourages the development of hand-eye coordination and fine motor skills, while spurring creativity. Great for Gifting: Makes a great gift for kids ages 3+ who want to build anywhere and everywhere. More to Explore: MAGNA-TILES microMAGS + Classic sets are a winning combo! Always Compatible: All pieces are compatible with and complementary to all other MAGNA-TILES sets, including all Classic MAGNA-TILES sets. Safety Guaranteed: All MAGNA-TILES pieces are built to withstand countless hours of playtime. Our signature lattice prevents cracking, while fastening rivets keep magnets safe and secure. Superior Quality: MAGNA-TILES pieces are made from food-grade, non-toxic MABS plastic that are free from BPAs, phthalates, and latex. Our magnets are selected with kids in mind, letting them easily pull apart tiles for safe, frustration-free building. Made With Purpose: MAGNA-TILES sets are loved by builders ages 3-99 and designed for kids to enjoy, without instructions or adult assistance. We're advocates for Meaningful Play that is Fun and Engaging, Experience Based, Child Led and Developmental.",
    "image_url": "https://m.media-amazon.com/images/I/71sdln0Gn1L._AC_SL1500_.jpg",
    "min_age": 3,
    "max_age": 99,
    "gender": "unisex",
    "category": "toys",
    "description": "This gift is perfect for creative kids who love to build and explore their imagination. Ideal for families who travel often, these magnetic tiles encourage hands-on play that helps develop fine motor skills and hand-eye coordination. Whether they’re playing at home or on the go, kids of all ages will enjoy endless possibilities with these colorful construction pieces.",
    "tags": [
      "creative",
      "builder",
      "travel-friendly",
      "hands-on",
      "educational"
    ]
  },
  {
    "name": "Hasbro Gaming Connect 4 Strategy Board Game for Ages 6 and Up (Amazon Exclusive)",
    "amazon_url": "https://www.amazon.com/dp/B06XY881H4",
    "price": 13.0,
    "prime_eligible": true,
    "product_description": "Add a blue disc to block opponents and lift discs higher Features blue Blocker Disc: This game includes blue Blocker Disc that open doors to new strategies Features blue Blocker Dics: this game includes blue Blocker Dics that open doors to new strategies",
    "image_url": "https://m.media-amazon.com/images/I/81Cx0btUF4L._AC_SL1500_.jpg",
    "min_age": 6,
    "max_age": 99,
    "gender": "unisex",
    "category": "games",
    "description": "This classic strategy board game is perfect for competitive thinkers and lovers of classic games. Ideal for families or friends who enjoy engaging in friendly rivalry and developing strategic skills. Great for kids and adults alike who appreciate a fun challenge.",
    "tags": [
      "board game",
      "strategy lover",
      "family fun"
    ]
  },
  {
    "name": "Taco Cat Goat Cheese Pizza Wildly Entertaining Card Game for Family and Group Game Night | Easy to Learn and Play with 10-15 Minute Rounds | Fun for Kids, Teens, Adults, and Families | 2-8 Players",
    "amazon_url": "https://www.amazon.com/dp/B077Z1R28P",
    "price": 7.0,
    "prime_eligible": true,
    "product_description": "Fast-Paced Fun for All Ages: Engage in a lively game where players race to match cards with spoken words like \"Taco,\" \"Cat,\" \"Goat,\" \"Cheese,\" and \"Pizza.\" Designed for 2–8 players aged 7 and up, each round lasts just 10–15 minutes, making it perfect for quick family card games or travel entertainment. Its simplicity and speed ensure everyone stays engaged and laughing. Simple Rules, Wild Gameplay: Players take turns playing cards while chanting the game's title in order. When a spoken word matches the card played, everyone races to slap the pile and the last one to do so takes the cards! Add in surprise action cards and it becomes a fast-paced, laugh-out-loud competition that's easy to learn but hard to stop playing. Card Games for Families and Social Events: Whether it's a holiday gathering, birthday party, or casual get-together, Taco Cat Goat Cheese Pizza is a go-to choice. Its easy-to-learn rules and engaging gameplay make it a hit among both kids and adults. It's also a top pick for stocking stuffers and Easter baskets, offering fun without the need for screens. Portable Entertainment for On-the-Go Fun: Compact and lightweight, this card game is travel-friendly, making it an excellent companion for road trips, vacations, or family outings. Its quick setup and short playtime ensure that you can enjoy a fun-filled game session anytime, anywhere. Boosts Cognitive Skills and Reflexes: Beyond entertainment, Taco Cat Goat Cheese Pizza helps develop important skills such as concentration, pattern recognition, and fine motor coordination. Players must stay alert and think quickly, making it both a fun and mentally stimulating activity for all ages.",
    "image_url": "https://m.media-amazon.com/images/I/61L3JcwfsDL._AC_SL1500_.jpg",
    "min_age": 7,
    "max_age": 99,
    "gender": "unisex",
    "category": "games",
    "description": "Perfect for families and friends who love engaging in lively and fast-paced activities. This game is a great fit for those who enjoy laughter-filled gatherings, quick thinking, and a bit of friendly competition. Ideal for kids, teens, and adults alike, it's the perfect addition to game nights, parties, or travel entertainment.",
    "tags": [
      "family fun",
      "game night",
      "card games",
      "quick play",
      "portable entertainment"
    ]
  },
  {
    "name": "Monopoly Deal: Harry Potter Card Game | Family Games for Kids and Adults | Ages 8 and Up | 2 to 5 Players | 15 mins. | Travel Size | Christmas Stocking Stuffers",
    "amazon_url": "https://www.amazon.com/dp/B0DBJF8W7R",
    "price": 6.0,
    "prime_eligible": true,
    "product_description": "INSPIRED BY HARRY POTTER: The Monopoly Deal: HARRY POTTER game combines the fast fun of the Monopoly Deal game with characters and themes inspired by the WIZARDING WORLD COLLECT MAGICAL ITEMS TO WIN: Compete to collect magical items from the HARRY POTTER universe, such as Butterbeer, a Golden Snitch, and a Chocolate Frog. The first to assemble 3 complete sets of objects wins GET HELP FROM FAVORITE CHARACTER’S CARDS: To start, players choose a Character card: HARRY POTTER, DRACO MALFOY, HERMIONE GRANGER, LUNA LOVEGOOD, and CEDRIC DIGGORY—each with a unique ability to use in the game CAST SPELLS TO DISRUPT OPPONENTS: “Obliviate!” “Stupefy!” “Wingardium Leviosa!” Play Spell cards to collect points, summon and swap items, and more PLAY IN 15 MINUTES: This quick-playing family card game for 2 to 5 players is an easy to learn game to play after dinner, on Family Game Night, and more FUN TRAVEL GAME: Looking for travel games for kids and adults to enjoy? Just toss this portable game into a bag to bring the magic of Hogwarts to the beach, vacations, and game nights with friends HARRY POTTER GIFTS: HARRY POTTER games and toys are enchanting gifts for HARRY POTTER fans ages 8+. And family card games are great for Easter Basket stuffers, white elephant gifts, and stocking stuffers",
    "image_url": "https://m.media-amazon.com/images/I/71SgAZcaEeL._AC_SL1500_.jpg",
    "min_age": 8,
    "max_age": 99,
    "gender": "unisex",
    "category": "games",
    "description": "Perfect for families and friends who love a mix of strategy and fun. This card game appeals to Harry Potter fans of all ages, especially those who enjoy quick and engaging gameplay during gatherings or travel. Ideal for anyone who appreciates a touch of magic in their game nights.",
    "tags": [
      "Harry Potter fan",
      "family games",
      "card game",
      "quick play",
      "travel game"
    ]
  },
  {
    "name": "Goliath Jelly Blox Creative Kit | Includes 20 Blocks | Toddler & Preschool Building Blocks Kids Can Squeeze, Stretch, Squish | MESH ACCREDITED | Safety Tested & Ouch-Free | Sensory Play Toy Ages 2+",
    "amazon_url": "https://www.amazon.com/dp/B0CP4BSFB9",
    "price": 19.0,
    "prime_eligible": true,
    "product_description": "CREATIVITY UNLEASHED: Jelly Blox are a unique building system featuring soft, safe, sensory construction that kids can squeeze, stretch, and squish for endless hours of engaging fun! Adults love Jelly Blox too! LEARN AND PLAY: Jelly Blox supports key developmental milestones and contains several special blocks filled with super sand, foam beads, mini stars and mini bricks for additional sensory and tactile fun! COMPATIBILITY: Jelly Blox Creative Kit includes 20 colorful blocks for hours of construction fun, and it's compatible with all other Jelly Blox Kits for expanded play and creativity OUCH-FREE: These squishy, smooshy blocks ensure there’s no need to worry about accidentally stepping on them, and they are easy to clean with gentle soap and water! SAFETY TESTED: Jelly Blox bricks undergo rigorous toy safety testing, including dropping, twisting, and pulling, to ensure they meet stringent global safety standards for worry-free play MESH ACCREDITED: Jelly Blox are MESH Accredited - MESH accredited products are evaluated based on their ability to help children develop skills like problem-solving, perseverance, adaptation, conflict resolution, self-regulation, self-advocacy, cognition, and communication.",
    "image_url": "https://m.media-amazon.com/images/I/91iq1JV8eeL._AC_SL1500_.jpg",
    "min_age": 2,
    "max_age": 6,
    "gender": "unisex",
    "category": "toys",
    "description": "This gift is perfect for toddlers and preschoolers who are full of creativity and love to explore their imagination through play. Ideal for children who enjoy hands-on activities, sensory experiences, and building, Jelly Blox will keep them engaged while supporting their developmental milestones. It's also great for parents looking for a safe, fun, and educational toy for their little ones.",
    "tags": [
      "creative",
      "sensory play",
      "building blocks",
      "toddler",
      "preschool",
      "educational"
    ]
  },
  {
    "name": "LEGO Botanicals Happy Plants Building Toys - Bedroom or Dorm Room Decor for Girls, Boys, & Adults, Desk or Shelf Display - Stocking Stuffers & Gift for Christmas - 10349",
    "amazon_url": "https://www.amazon.com/dp/B0DRW6C2RF",
    "price": 18.0,
    "prime_eligible": true,
    "product_description": "DELIGHT YOUNG GARDENERS – Help little ones get growing with the LEGO Botanicals Happy Plants building set for kids ages 9+ A FUN AND COLORFUL BUILD – Green thumbs will love constructing the baby dracaena plant and baby pilea plants, and deciding which to plant in two adorable smiling pots HELP CREATIVITY GROW – Kids can build the plants independently or share the fun by building them with a friend or family member BUILD, PLAY, AND DISPLAY – Brighten up any play space, shelf, or desk with LEGO plants that double as whimsical, kid-friendly decor GIFT IDEA FOR KIDS – The building kit makes a great birthday or anytime treat for girls and boys, or a fun gift for adults who love plants, crafting, or nature BUILD MORE LEGO BLOOMS – These brick-built plants can be combined with other sets (sold separately) in the LEGO Botanicals collection, which includes other trees and LEGO flowers DIMENSIONS – The dracaena plant in this 217-piece set measures over 4.5 in. (12 cm) high and 3 in. (8 cm) wide, while the pilea plant measures over 3 in. (7 cm) high and 3.5 in. (9 cm) wide",
    "image_url": "https://m.media-amazon.com/images/I/7126IIfAZgL._AC_SL1500_.jpg",
    "min_age": 9,
    "max_age": 99,
    "gender": "unisex",
    "category": "toys",
    "description": "This gift is perfect for young gardeners and creative minds who love to engage in hands-on activities. It's ideal for kids and adults alike who enjoy crafting, building, and decorating their spaces with unique, colorful designs. Great for those who appreciate nature and want to bring a bit of greenery into their home or office.",
    "tags": [
      "plant lover",
      "creative",
      "builder",
      "gardening enthusiast",
      "DIY"
    ]
  },
  {
    "name": "Monopoly Deal Card Game | Quick-Playing Card Game | Fun Games for Families and Kids | Ages 8 and Up | 2 to 5 Players | 15 Mins. | Travel Games",
    "amazon_url": "https://www.amazon.com/dp/B00NQQTZCO",
    "price": 7.0,
    "prime_eligible": true,
    "product_description": "QUICK-PLAYING MONOPOLY CARD GAME: Swap, steal, and scheme in the Monopoly Deal card game—a family favorite! It’s all the fun of the Monopoly game in a fast-paced card game for kids and adults. PLAY IN 15 MINUTES: It’s the Fast-Dealing Property Trading Game … made even faster! The Monopoly card game plays in as little as 15 minutes, so it’s a great family card game for anytime fun COLLECT 3 PROPERTY SETS TO WIN: In this exciting strategy card game, be the first player to collect 3 complete Property sets, each in a different color, to win ACTION CARDS CHANGE THE GAME: Use Action Cards to collect rent, steal and swap properties, or take money from other players when “It’s Your Birthday!” EASY TO LEARN AND PLAY: The Monopoly Deal card game is a snap to learn, teach, and play. It even comes with handy reference cards to remind players what to do on their turn, as well as tips and rules FUN FAMILY CARD GAME: Quick to play and easy to set up, this game for 2 to 5 players is a Family Game Night go-to. Or break it out for a fast game before dinner, after school, and more TRAVEL GAME FOR KIDS AND FAMILIES: Looking for 2 player games or kids travel games? This portable game for 2 to 5 players is an excellent travel card game for families and kids ages 8 and up",
    "image_url": "https://m.media-amazon.com/images/I/81SQgE435+L._AC_SL1500_.jpg",
    "min_age": 8,
    "max_age": 99,
    "gender": "unisex",
    "category": "games",
    "description": "This game is perfect for families and friends who enjoy quick, engaging, and competitive card games. Ideal for those who appreciate strategy, enjoy playful banter, and want to create memorable moments during family game nights. It's also great for kids and adults who love to travel and need a fun game to play on the go.",
    "tags": [
      "family fun",
      "card games",
      "strategy",
      "travel games",
      "competitive spirit"
    ]
  },
  {
    "name": "PlayStation DualSense® Wireless Controller - Midnight Black",
    "amazon_url": "https://www.amazon.com/dp/B0CQKKHT5J",
    "price": 42.0,
    "prime_eligible": true,
    "product_description": "Bring gaming worlds to life - Feel your in-game actions and environment simulated through haptic feedback*. Experience varying force and tension at your fingertips with adaptive triggers* Find your voice, share your passion - Chat online through the built-in microphone. Connect a headset directly via the 3.5mm jack. Record and broadcast your epic gaming moments with the create button A gaming icon in your hands - Enjoy a comfortable, evolved design with an iconic layout and enhanced sticks. Hear higher-fidelity** sound effects through the built-in speaker in supported games Multi-device connectivity - Connect using a USB Type-C cable or Bluetooth technology and easily play on more devices including Windows PC and Mac computers. Elevate PC gaming with advanced features like haptic feedback and adaptive triggers in a range of blockbuster PC titles.",
    "image_url": "https://m.media-amazon.com/images/I/61GNEp3auhL._SL1500_.jpg",
    "min_age": 12,
    "max_age": 40,
    "gender": "unisex",
    "category": "electronics",
    "description": "This gift is perfect for gamers who appreciate immersive experiences and cutting-edge technology. Ideal for those who love to connect with friends online and enjoy the latest in gaming innovations, the DualSense controller enhances gameplay with its haptic feedback and adaptive triggers. Whether playing on a console or PC, this controller will elevate any gaming session for passionate players.",
    "tags": [
      "gamer",
      "tech enthusiast",
      "online player"
    ]
  }
]